<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"821581293206cbf334a05507bd2530444fa6d6b5e5cfb4c0146ae905587827ef","plan_job_ref":"Job Write Terraform Plan to Pull Request #75 at https://github.com/hackforla/devops-security/actions/runs/13422363963","plan_out_hash":"6576e3ac48ced36643f5698c9e206aecede6909bb9f5d701697b6c399897aab6","plan_hash":"62e5d478a2d56275bf88d1311f055c215321ede94a42fc64f54b80029e14b444","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_gmgonzal.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "gmgonzal"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_gmgonzal.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "gmgonzal"
    }

  # module.iam_user_gmgonzal.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "gmgonzal"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #75](https://github.com/hackforla/devops-security/actions/runs/13422363963)